<!-- add-pr-comment:add-pr-comment -->

```
Acquiring state lock. This may take a few moments...
data.azurerm_key_vault.dvinlabkv: Reading...
azurerm_public_ip.publicip1: Refreshing state... [id=/subscriptions/86f76907-b9d5-46fa-a39d-aff8432a1868/resourceGroups/rg-dnazareno/providers/Microsoft.Network/publicIPAddresses/dnazareno_publicip1]
azurerm_container_registry.azcr2: Refreshing state... [id=/subscriptions/86f76907-b9d5-46fa-a39d-aff8432a1868/resourceGroups/rg-dnazareno/providers/Microsoft.ContainerRegistry/registries/dnazarenocrdev]
azurerm_network_interface.aznic: Refreshing state... [id=/subscriptions/86f76907-b9d5-46fa-a39d-aff8432a1868/resourceGroups/rg-dnazareno/providers/Microsoft.Network/networkInterfaces/dnazareno_aznic1]
azurerm_container_registry.azcr1: Refreshing state... [id=/subscriptions/86f76907-b9d5-46fa-a39d-aff8432a1868/resourceGroups/rg-dnazareno/providers/Microsoft.ContainerRegistry/registries/dnazarenocrprod]
azurerm_network_security_group.aznsc: Refreshing state... [id=/subscriptions/86f76907-b9d5-46fa-a39d-aff8432a1868/resourceGroups/rg-dnazareno/providers/Microsoft.Network/networkSecurityGroups/dnazareno_secgroup]
data.azurerm_key_vault.dvinlabkv: Read complete after 0s [id=/subscriptions/86f76907-b9d5-46fa-a39d-aff8432a1868/resourceGroups/rg-dnazareno-dvfinlab/providers/Microsoft.KeyVault/vaults/akv-dnazareno-dvfinlab]
azurerm_network_interface.aznic2: Refreshing state... [id=/subscriptions/86f76907-b9d5-46fa-a39d-aff8432a1868/resourceGroups/rg-dnazareno/providers/Microsoft.Network/networkInterfaces/dnazareno_aznic2]
data.azurerm_key_vault_secret.getvmpass: Reading...
azurerm_network_interface_security_group_association.example: Refreshing state... [id=/subscriptions/86f76907-b9d5-46fa-a39d-aff8432a1868/resourceGroups/rg-dnazareno/providers/Microsoft.Network/networkInterfaces/dnazareno_aznic1|/subscriptions/86f76907-b9d5-46fa-a39d-aff8432a1868/resourceGroups/rg-dnazareno/providers/Microsoft.Network/networkSecurityGroups/dnazareno_secgroup]
azurerm_network_interface_security_group_association.example2: Refreshing state... [id=/subscriptions/86f76907-b9d5-46fa-a39d-aff8432a1868/resourceGroups/rg-dnazareno/providers/Microsoft.Network/networkInterfaces/dnazareno_aznic2|/subscriptions/86f76907-b9d5-46fa-a39d-aff8432a1868/resourceGroups/rg-dnazareno/providers/Microsoft.Network/networkSecurityGroups/dnazareno_secgroup]
data.azurerm_key_vault_secret.getvmpass: Read complete after 2s [id=https://akv-dnazareno-dvfinlab.vault.azure.net/secrets/vmpass/41ec16f55a78426dbe24fd509ec1f72f]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_container_registry.azcr1 must be replaced
-/+ resource "azurerm_container_registry" "azcr1" {
      ~ admin_password                = (sensitive value)
      ~ admin_username                = "dnazarenocrprod" -> (known after apply)
      - anonymous_pull_enabled        = false -> null
      - data_endpoint_enabled         = false -> null
      ~ encryption                    = [
          - {
              - enabled            = false
                # (2 unchanged attributes hidden)
            },
        ] -> (known after apply)
      ~ id                            = "/subscriptions/86f76907-b9d5-46fa-a39d-aff8432a1868/resourceGroups/rg-dnazareno/providers/Microsoft.ContainerRegistry/registries/dnazarenocrprod" -> (known after apply)
      ~ location                      = "uksouth" -> "westeurope" # forces replacement
      ~ login_server                  = "dnazarenocrprod.azurecr.io" -> (known after apply)
        name                          = "dnazarenocrprod"
      ~ network_rule_set              = [] -> (known after apply)
      - quarantine_policy_enabled     = false -> null
      ~ retention_policy              = [
          - {
              - days    = 7
              - enabled = false
            },
        ] -> (known after apply)
      - tags                          = {} -> null
      ~ trust_policy                  = [
          - {
              - enabled = false
            },
        ] -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_container_registry.azcr2 must be replaced
-/+ resource "azurerm_container_registry" "azcr2" {
      ~ admin_password                = (sensitive value)
      ~ admin_username                = "dnazarenocrdev" -> (known after apply)
      - anonymous_pull_enabled        = false -> null
      - data_endpoint_enabled         = false -> null
      ~ encryption                    = [
          - {
              - enabled            = false
                # (2 unchanged attributes hidden)
            },
        ] -> (known after apply)
      ~ id                            = "/subscriptions/86f76907-b9d5-46fa-a39d-aff8432a1868/resourceGroups/rg-dnazareno/providers/Microsoft.ContainerRegistry/registries/dnazarenocrdev" -> (known after apply)
      ~ location                      = "uksouth" -> "westeurope" # forces replacement
      ~ login_server                  = "dnazarenocrdev.azurecr.io" -> (known after apply)
        name                          = "dnazarenocrdev"
      ~ network_rule_set              = [] -> (known after apply)
      - quarantine_policy_enabled     = false -> null
      ~ retention_policy              = [
          - {
              - days    = 7
              - enabled = false
            },
        ] -> (known after apply)
      - tags                          = {} -> null
      ~ trust_policy                  = [
          - {
              - enabled = false
            },
        ] -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_linux_virtual_machine.backup["mv1"] will be created
  + resource "azurerm_linux_virtual_machine" "backup" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "vm2user"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = false
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "uksouth"
      + max_bid_price                                          = -1
      + name                                                   = "vmbackup"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "rg-dnazareno"
      + size                                                   = "Standard_B1ms"
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = false

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "Canonical"
          + sku       = "22_04-lts"
          + version   = "latest"
        }

      + termination_notification (known after apply)
    }

  # azurerm_linux_virtual_machine.db["mv1"] will be created
  + resource "azurerm_linux_virtual_machine" "db" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "vm1user"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = false
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "uksouth"
      + max_bid_price                                          = -1
      + name                                                   = "vmmysql"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "rg-dnazareno"
      + size                                                   = "Standard_B1ms"
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = false

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "Canonical"
          + sku       = "22_04-lts"
          + version   = "latest"
        }

      + termination_notification (known after apply)
    }

  # azurerm_network_interface.aznic must be replaced
-/+ resource "azurerm_network_interface" "aznic" {
      ~ applied_dns_servers           = [] -> (known after apply)
      ~ dns_servers                   = [] -> (known after apply)
      ~ id                            = "/subscriptions/86f76907-b9d5-46fa-a39d-aff8432a1868/resourceGroups/rg-dnazareno/providers/Microsoft.Network/networkInterfaces/dnazareno_aznic1" -> (known after apply)
      + internal_dns_name_label       = (known after apply)
      ~ internal_domain_name_suffix   = "teufntzwsvfuzontcb5b55q0sh.zx.internal.cloudapp.net" -> (known after apply)
      ~ location                      = "uksouth" -> "westeurope" # forces replacement
      + mac_address                   = (known after apply)
        name                          = "dnazareno_aznic1"
      ~ private_ip_address            = "10.0.27.4" -> (known after apply)
      ~ private_ip_addresses          = [
          - "10.0.27.4",
        ] -> (known after apply)
      - tags                          = {} -> null
      + virtual_machine_id            = (known after apply)
        # (6 unchanged attributes hidden)

      ~ ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
            name                                               = "dnazareno_ipconfig"
          ~ primary                                            = true -> (known after apply)
          ~ private_ip_address                                 = "10.0.27.4" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # azurerm_network_interface.aznic2 must be replaced
-/+ resource "azurerm_network_interface" "aznic2" {
      ~ applied_dns_servers           = [] -> (known after apply)
      ~ dns_servers                   = [] -> (known after apply)
      ~ id                            = "/subscriptions/86f76907-b9d5-46fa-a39d-aff8432a1868/resourceGroups/rg-dnazareno/providers/Microsoft.Network/networkInterfaces/dnazareno_aznic2" -> (known after apply)
      + internal_dns_name_label       = (known after apply)
      ~ internal_domain_name_suffix   = "teufntzwsvfuzontcb5b55q0sh.zx.internal.cloudapp.net" -> (known after apply)
      ~ location                      = "uksouth" -> "westeurope" # forces replacement
      + mac_address                   = (known after apply)
        name                          = "dnazareno_aznic2"
      ~ private_ip_address            = "10.0.27.5" -> (known after apply)
      ~ private_ip_addresses          = [
          - "10.0.27.5",
        ] -> (known after apply)
      - tags                          = {} -> null
      + virtual_machine_id            = (known after apply)
        # (6 unchanged attributes hidden)

      ~ ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
            name                                               = "dnazareno_ipconfig"
          ~ primary                                            = true -> (known after apply)
          ~ private_ip_address                                 = "10.0.27.5" -> (known after apply)
          ~ public_ip_address_id                               = "/subscriptions/86f76907-b9d5-46fa-a39d-aff8432a1868/resourceGroups/rg-dnazareno/providers/Microsoft.Network/publicIPAddresses/dnazareno_publicip1" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

  # azurerm_network_interface_security_group_association.example must be replaced
-/+ resource "azurerm_network_interface_security_group_association" "example" {
      ~ id                        = "/subscriptions/86f76907-b9d5-46fa-a39d-aff8432a1868/resourceGroups/rg-dnazareno/providers/Microsoft.Network/networkInterfaces/dnazareno_aznic1|/subscriptions/86f76907-b9d5-46fa-a39d-aff8432a1868/resourceGroups/rg-dnazareno/providers/Microsoft.Network/networkSecurityGroups/dnazareno_secgroup" -> (known after apply)
      ~ network_interface_id      = "/subscriptions/86f76907-b9d5-46fa-a39d-aff8432a1868/resourceGroups/rg-dnazareno/providers/Microsoft.Network/networkInterfaces/dnazareno_aznic1" # forces replacement -> (known after apply) # forces replacement
      ~ network_security_group_id = "/subscriptions/86f76907-b9d5-46fa-a39d-aff8432a1868/resourceGroups/rg-dnazareno/providers/Microsoft.Network/networkSecurityGroups/dnazareno_secgroup" # forces replacement -> (known after apply) # forces replacement
    }

  # azurerm_network_interface_security_group_association.example2 must be replaced
-/+ resource "azurerm_network_interface_security_group_association" "example2" {
      ~ id                        = "/subscriptions/86f76907-b9d5-46fa-a39d-aff8432a1868/resourceGroups/rg-dnazareno/providers/Microsoft.Network/networkInterfaces/dnazareno_aznic2|/subscriptions/86f76907-b9d5-46fa-a39d-aff8432a1868/resourceGroups/rg-dnazareno/providers/Microsoft.Network/networkSecurityGroups/dnazareno_secgroup" -> (known after apply)
      ~ network_interface_id      = "/subscriptions/86f76907-b9d5-46fa-a39d-aff8432a1868/resourceGroups/rg-dnazareno/providers/Microsoft.Network/networkInterfaces/dnazareno_aznic2" # forces replacement -> (known after apply) # forces replacement
      ~ network_security_group_id = "/subscriptions/86f76907-b9d5-46fa-a39d-aff8432a1868/resourceGroups/rg-dnazareno/providers/Microsoft.Network/networkSecurityGroups/dnazareno_secgroup" # forces replacement -> (known after apply) # forces replacement
    }

  # azurerm_network_security_group.aznsc must be replaced
-/+ resource "azurerm_network_security_group" "aznsc" {
      ~ id                  = "/subscriptions/86f76907-b9d5-46fa-a39d-aff8432a1868/resourceGroups/rg-dnazareno/providers/Microsoft.Network/networkSecurityGroups/dnazareno_secgroup" -> (known after apply)
      ~ location            = "uksouth" -> "westeurope" # forces replacement
        name                = "dnazareno_secgroup"
      - tags                = {} -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_public_ip.publicip1 must be replaced
-/+ resource "azurerm_public_ip" "publicip1" {
      + fqdn                    = (known after apply)
      ~ id                      = "/subscriptions/86f76907-b9d5-46fa-a39d-aff8432a1868/resourceGroups/rg-dnazareno/providers/Microsoft.Network/publicIPAddresses/dnazareno_publicip1" -> (known after apply)
      ~ ip_address              = "172.167.230.207" -> (known after apply)
      - ip_tags                 = {} -> null
      ~ location                = "uksouth" -> "westeurope" # forces replacement
        name                    = "dnazareno_publicip1"
      - tags                    = {} -> null
      - zones                   = [] -> null
        # (8 unchanged attributes hidden)
    }

Plan: 10 to add, 0 to change, 8 to destroy.

Changes to Outputs:
  ~ cr1_admin_password  = (sensitive value)
  ~ cr1_admin_username  = "dnazarenocrprod" -> (known after apply)
  ~ cr2_admin_password  = (sensitive value)
  ~ cr2_admin_username  = "dnazarenocrdev" -> (known after apply)
  ~ public_ip_address   = "172.167.230.207" -> (known after apply)
Releasing state lock. This may take a few moments...
```